src/Documents/УстановкаСкидокПоставщиковVMI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>УстановкаСкидокПоставщиковVMI</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СкидкиПоставщиковVMI</xr:Item>
				<xr:Item>AccumulationRegister.СкидкиVMI</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяСуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ВидыСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыСкидок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СОграничениемПоОбщейСумме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезОграниченияПоОбщейСумме</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/УстановкаСкидокПоставщиковVMI/Ext/ManagerModule.bsl
Процедура ВыполнитьПроведение(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	
	Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "СкидкиПоставщиковVMI") Тогда
		ОбщегоНазначения.ЗаписатьДвиженияДокумента(вхСсылкаНаДокумент, "СкидкиПоставщиковVMI", РегистрыСведений_СкидкиПоставщиковVMI(вхСсылкаНаДокумент, вхОтказ));
	КонецЕсли;
	
	Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "СкидкиVMI") Тогда
		ОбщегоНазначения.ЗаписатьДвиженияДокумента(вхСсылкаНаДокумент, "СкидкиVMI", РегистрыНакопления_СкидкиVMI(вхСсылкаНаДокумент, вхОтказ));
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьОтменуПроведения(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	
	Если НЕ вхОтказ Тогда
		ПроведениеДокументовКлиентСервер.ОчиститьДвиженияДокумента(вхСсылкаНаДокумент);
	КонецЕсли;
		
КонецПроцедуры

Функция РегистрыСведений_СкидкиПоставщиковVMI(вхСсылкаНаДокумент, вхОтказ) 
	
	ТаблицаДвижений = Неопределено;
	ОбщегоНазначения.СоздатьСтруктуруРегистраСведений("СкидкиПоставщиковVMI", ТаблицаДвижений);
	ДатаОкончания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент, "ДатаОкончания");
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	УстановкаСкидокПоставщиковVMI.Дата КАК Период,
	                |	УстановкаСкидокПоставщиковVMI.Ссылка КАК Регистратор,
	                |	УстановкаСкидокПоставщиковVMI.Контрагент,
	                |	УстановкаСкидокПоставщиковVMI.ВидСкидки,
	                |	УстановкаСкидокПоставщиковVMI.ПроцентСкидки,
	                |	&ДатаОкончания КАК ДатаОкончания
	                |ИЗ
	                |	Документ.УстановкаСкидокПоставщиковVMI КАК УстановкаСкидокПоставщиковVMI
	                |ГДЕ
	                |	УстановкаСкидокПоставщиковVMI.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	Запрос.УстановитьПараметр("ДатаОкончания", ?(ЗначениеЗаполнено(ДатаОкончания), КонецДня(ДатаОкончания), Дата(3999,12,31,23,59,59)));
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), ТаблицаДвижений);
	
	Возврат ТаблицаДвижений;
	
КонецФункции

Функция РегистрыНакопления_СкидкиVMI(вхСсылкаНаДокумент, вхОтказ) 
	
	ТаблицаДвижений = Неопределено;
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("СкидкиVMI", ТаблицаДвижений);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УстановкаСкидокПоставщиковVMI.Дата КАК Период,
	               |	УстановкаСкидокПоставщиковVMI.Ссылка КАК Регистратор,
	               |	УстановкаСкидокПоставщиковVMI.Контрагент,
	               |	УстановкаСкидокПоставщиковVMI.МаксимальнаяСуммаСкидки КАК СуммаУпр
	               |ИЗ
	               |	Документ.УстановкаСкидокПоставщиковVMI КАК УстановкаСкидокПоставщиковVMI
	               |ГДЕ
	               |	УстановкаСкидокПоставщиковVMI.Ссылка = &Ссылка
	               |	И УстановкаСкидокПоставщиковVMI.ВидСкидки = &ВидСкидки";
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	Запрос.УстановитьПараметр("ВидСкидки", Перечисления.ВидыСкидок.СОграничениемПоОбщейСумме);
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), ТаблицаДвижений);
	
	Возврат ТаблицаДвижений;
	
КонецФункции
